xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc_Pdb.c
/* Check if source file and Adc_Pdb header file are from the same vendor */
#if (ADC_AR_VENDOR_ID_PDB_C != ADC_VENDOR_ID_PDB)
    #error "Adc_Pdb.c and Adc_Pdb.h have different vendor ids"
#endif

/* Check if source file and Adc_Pdb header file are of the same Autosar version */
#if ((ADC_AR_RELEASE_MAJOR_VERSION_PDB_C != ADC_AR_RELEASE_MAJOR_VERSION_PDB) || \
     (ADC_AR_RELEASE_MINOR_VERSION_PDB_C != ADC_AR_RELEASE_MINOR_VERSION_PDB) || \
     (ADC_AR_RELEASE_REVISION_VERSION_PDB_C != ADC_AR_RELEASE_REVISION_VERSION_PDB) \
    )
    #error "AutoSar Version Numbers of Adc_Pdb.c and Adc_Pdb.h are different"
#endif

/* Check if source file and Adc_Pdb header file are of the same Software version */
#if ((ADC_SW_MAJOR_VERSION_PDB_C != ADC_SW_MAJOR_VERSION_PDB) || \
     (ADC_SW_MINOR_VERSION_PDB_C != ADC_SW_MINOR_VERSION_PDB) || \
     (ADC_SW_PATCH_VERSION_PDB_C != ADC_SW_PATCH_VERSION_PDB) \
    )
    #error "Software Version Numbers of Adc_Pdb.c and Adc_Pdb.h are different"
#endif

/* Check if source file and ADC configuration header file are of the same vendor */
#if (ADC_AR_VENDOR_ID_PDB_C != ADC_VENDOR_ID_CFG)
#error "Adc_Pdb.c and Adc_Cfg.h have different vendor ids"
#endif

/* Check if source file and ADC configuration header file are of the same Autosar version */
#if ((ADC_AR_RELEASE_MAJOR_VERSION_PDB_C != ADC_AR_RELEASE_MAJOR_VERSION_CFG) || \
     (ADC_AR_RELEASE_MINOR_VERSION_PDB_C != ADC_AR_RELEASE_MINOR_VERSION_CFG) || \
     (ADC_AR_RELEASE_REVISION_VERSION_PDB_C != ADC_AR_RELEASE_REVISION_VERSION_CFG) \
    )
#error "AutoSar Version Numbers of Adc_Pdb.c and Adc_Cfg.h are different"
#endif

/* Check if source file and ADC configuration header file are of the same software version */
#if ((ADC_SW_MAJOR_VERSION_PDB_C != ADC_SW_MAJOR_VERSION_CFG) || \
     (ADC_SW_MINOR_VERSION_PDB_C != ADC_SW_MINOR_VERSION_CFG) || \
     (ADC_SW_PATCH_VERSION_PDB_C != ADC_SW_PATCH_VERSION_CFG) \
    )
#error "Software Version Numbers of Adc_Pdb.c and Adc_Cfg.h are different"
#endif

/** @violates @ref Adc_Pdb_c_REF_4 MISRA-C:2004 Rule 1.4: Identifier clash.*/
#ifndef DISABLE_MCAL_INTERMODULE_ASR_CHECK
 /* Check if source file and Mcal header file are of the same AutoSar version */
 #if ((ADC_AR_RELEASE_MAJOR_VERSION_PDB_C != MCAL_AR_RELEASE_MAJOR_VERSION) || \
      (ADC_AR_RELEASE_MINOR_VERSION_PDB_C != MCAL_AR_RELEASE_MINOR_VERSION) \
     )
 #error "AutoSar Version Numbers of Adc_Pdb.c and Mcal.h are different"
 #endif
 /* Check if source file and SilREgMacros header file are of the same AutoSar version */
 #if ((ADC_AR_RELEASE_MAJOR_VERSION_PDB_C != SILREGMACROS_AR_RELEASE_MAJOR_VERSION) || \
      (ADC_AR_RELEASE_MINOR_VERSION_PDB_C != SILREGMACROS_AR_RELEASE_MINOR_VERSION) \
     )
 #error "AutoSar Version Numbers of Adc_Pdb.c and SilRegMacros.h are different"
 #endif
#endif
/*==================================================================================================
*                          LOCAL TYPEDEFS (STRUCTURES, UNIONS, ENUMS)
==================================================================================================*/

/*==================================================================================================
*                                       LOCAL MACROS
==================================================================================================*/

/*==================================================================================================
*                                      LOCAL CONSTANTS
==================================================================================================*/
#define ADC_START_SEC_CONST_32
/** @violates @ref Adc_Pdb_c_REF_2 Repeated include file MemMap.h */
/** @violates @ref Adc_Pdb_c_REF_1 Only preprocessor statements and comments before "#include" */
#include "Adc_MemMap.h"
/** @violates @ref Adc_Pdb_c_REF_8 MISRA 2004 Required Rule 8.7, objects shall be defined at block scope */
static CONST(uint32, ADC_CONST) PDB_CHNC1_MASK[] =
{
    0x0U,
    0x1U,
    0x3U,
    0x7U,
    0xFU,
    0x1FU,
    0x3FU,
    0x7FU,
    0xFFU
};
#define ADC_STOP_SEC_CONST_32
/** @violates @ref Adc_Pdb_c_REF_2 Repeated include file MemMap.h */
/** @violates @ref Adc_Pdb_c_REF_1 Only preprocessor statements and comments before "#include" */
#include "Adc_MemMap.h"
/*==================================================================================================
*                                      LOCAL VARIABLES
==================================================================================================*/

/*==================================================================================================
*                                      GLOBAL CONSTANTS
==================================================================================================*/

/*==================================================================================================
*                                      GLOBAL VARIABLES
==================================================================================================*/

#define ADC_START_SEC_CONST_32
/** @violates @ref Adc_Pdb_c_REF_2 Repeated include file MemMap.h */
/** @violates @ref Adc_Pdb_c_REF_1 Only preprocessor statements and comments before "#include" */
#include "Adc_MemMap.h"
/** @violates @ref Adc_Pdb_c_REF_5 External linkage.*/
CONST(uint32, ADC_CONST) PDB_BASE_ADDR32[ADC_PDB_NUM_MODULES] =
{
#ifdef PDB0_BASEADDR
    PDB0_BASEADDR,
#endif
#if (ADC_PDB_NUM_MODULES > 1U)
#ifdef PDB1_BASEADDR
    PDB1_BASEADDR
#endif
#endif
};
#define ADC_STOP_SEC_CONST_32
/** @violates @ref Adc_Pdb_c_REF_2 Repeated include file MemMap.h */
/** @violates @ref Adc_Pdb_c_REF_1 Only preprocessor statements and comments before "#include" */
#include "Adc_MemMap.h"

/*==================================================================================================
*                                   LOCAL FUNCTION PROTOTYPES
==================================================================================================*/


/*==================================================================================================
*                                       LOCAL FUNCTIONS
==================================================================================================*/
#define ADC_START_SEC_CODE
/**
 * @violates @ref Adc_Pdb_c_REF_2 Repeated include file MemMap.h
 * @violates @ref Adc_Pdb_c_REF_1 Only preprocessor statements and comments before "#include"
 */
#include "Adc_MemMap.h"

/*==================================================================================================
                                       GLOBAL FUNCTIONS
==================================================================================================*/
/**
* @brief          This function initializes PDB module
* @details        This function initializes PDB clock configuration: prescaler, multiplication, channel sequence error
*
* @param[in]      Unit                    the current HW Unit.
* @param[in]      u32PdbClockConfig       Clock configuration for PDB
*
* @return         void
*
*/
FUNC(void, ADC_CODE) Adc_Pdb_Init
(
    VAR(Adc_HwUnitType,AUTOMATIC) Unit,
    VAR(uint32, AUTOMATIC) u32PdbClockConfig
)
{
    /* Initialize PDB clock registers according to user configuration */
    /** @violates @ref Adc_Pdb_c_REF_3 cast from unsigned long to pointer */
    /** @violates @ref Adc_Pdb_c_REF_7 A cast should not be performed between a pointer type and an integral type. */
    REG_WRITE32(PDB_SC_REG_ADDR32(Unit), u32PdbClockConfig);
}

#if (ADC_DEINIT_API == STD_ON)
/**
* @brief          This function deinitializes the PDB hardware.
*
* @return         void
*
*/
FUNC(void, ADC_CODE) Adc_Pdb_DeInit(void)
{
    VAR(uint8, AUTOMATIC) u8UnitIndex = 0U;
    VAR(uint8, AUTOMATIC) u8ChannelIndex = 0U;
    VAR(uint8, AUTOMATIC) u8RegisterIndex = 0U;

    /* De-initialize all units */
    for(u8UnitIndex = (uint8)0U; u8UnitIndex < (uint8)ADC_PDB_NUM_MODULES; u8UnitIndex++)
    {
        /* Reset period of the counter, when the counter reaches this value, it will be reset back to zero */
        /** @violates @ref Adc_Pdb_c_REF_3 cast from unsigned long to pointer */
        /** @violates @ref Adc_Pdb_c_REF_7 A cast should not be performed between a pointer type and an integral type. */
        REG_WRITE32(PDB_MOD_REG_ADDR32(u8UnitIndex), PDB_MOD_RESET_VALUE_U32);

        /* Reset interrupt delay register */
        /** @violates @ref Adc_Pdb_c_REF_3 cast from unsigned long to pointer */
        /** @violates @ref Adc_Pdb_c_REF_7 A cast should not be performed between a pointer type and an integral type. */
        REG_WRITE32(PDB_IDLY_REG_ADDR32(u8UnitIndex), PDB_INTERRUPT_DELAY_RESET_VALUE_U32);

