xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc_Pdb.c
        /* De-initialize for each unit channel */
        for (u8ChannelIndex = 0U; u8ChannelIndex < ADC_PDB_CHANNELS_U8; u8ChannelIndex++)
        {
            /** @violates @ref Adc_Pdb_c_REF_3 cast from unsigned long to pointer */
            /** @violates @ref Adc_Pdb_c_REF_7 A cast should not be performed between a pointer type and an integral type. */
            REG_WRITE32(PDB_CHCn1_REG_ADDR32(u8UnitIndex, u8ChannelIndex), PDB_CH_CONTROL_RESET_VALUE_U32);
            /** @violates @ref Adc_Pdb_c_REF_3 cast from unsigned long to pointer */
            /** @violates @ref Adc_Pdb_c_REF_7 A cast should not be performed between a pointer type and an integral type. */
            REG_WRITE32(PDB_CHnS_REG_ADDR32(u8UnitIndex, u8ChannelIndex), PDB_STATUS_CH_FLAGS_CLEAR_ALL_U32);

            /* De-initialize for each pre-trigger */
            for (u8RegisterIndex = 0U; u8RegisterIndex < ADC_PDB_NUM_DELAY_REGISTER; u8RegisterIndex++)
            {
                /** @violates @ref Adc_Pdb_c_REF_3 cast from unsigned long to pointer */
                /** @violates @ref Adc_Pdb_c_REF_7 A cast should not be performed between a pointer type and an integral type. */
                REG_WRITE32(PDB_CHnDLYx_REG_ADDR32(u8UnitIndex, u8ChannelIndex, u8RegisterIndex), PDB_CH_DELAY_RESET_VALUE_U32);
            }
        }

        SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_11();
        /* Set Load OK bit to update de-initialize configuration */
        /** @violates @ref Adc_Pdb_c_REF_3 cast from unsigned long to pointer */
        /** @violates @ref Adc_Pdb_c_REF_7 A cast should not be performed between a pointer type and an integral type. */
        REG_BIT_SET32(PDB_SC_REG_ADDR32(u8UnitIndex), PDB_LOAD_OK_U32);
        SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_11();

        /* Reset the SC register */
        /** @violates @ref Adc_Pdb_c_REF_3 cast from unsigned long to pointer */
        /** @violates @ref Adc_Pdb_c_REF_7 A cast should not be performed between a pointer type and an integral type. */
        REG_WRITE32(PDB_SC_REG_ADDR32(u8UnitIndex), PDB_SC_RESET_VALUE_U32);
    }
}
#endif

/**
* @brief          This function configure PDB hardware for each conversion
* @details        This function configure PDB hardware for each conversion
*
* @param[in]      Unit                    the current HW Unit.
* @param[in]      Group                   Channel group
* @param[in]      pGroupPtr               pointer to group configuration
* @param[in]      Trigger                 hardware or software trigger
* @param[in]      u16CurrentChannel       last channel converted
* @param[in]      u8NumChannel            number of channel used for this conversion
*
* @return         void
*
*/
/** @violates @ref Adc_Pdb_c_REF_5 External linkage.*/
FUNC(void, ADC_CODE) Adc_Pdb_ConfigurePartialConversion
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit,
    CONST(Adc_GroupType, AUTOMATIC) Group,
    P2CONST(Adc_GroupConfigurationType, AUTOMATIC, ADC_APPL_CONST) pGroupPtr,
    VAR(Adc_HwTriggerTimerType, AUTOMATIC) Trigger,
    VAR(uint16, AUTOMATIC) u16CurrentChannel,
    VAR(uint8, AUTOMATIC) u8NumChannel
)
{
    VAR(uint8, AUTOMATIC) u8PdbIndex;
    VAR(uint8, AUTOMATIC) u8PreTriggerCtr;
    VAR(uint8, AUTOMATIC) u8PdbChannelUsed;
    VAR(uint16, AUTOMATIC) u16CurrentCh;
    VAR(uint32, AUTOMATIC) u32ChEnable;
    VAR(uint32, AUTOMATIC) u32ChConfig;
    VAR(uint8, AUTOMATIC) u8LeftChannel;
    VAR(uint8, AUTOMATIC) u8ChUsed;
    VAR(uint16, AUTOMATIC) u16PeriodPdb = 0U;
    VAR(uint16, AUTOMATIC) u16PdbDelay;
    P2CONST(uint16, AUTOMATIC, ADC_APPL_CONST) pGroupDelay = NULL_PTR;
#if (ADC_SETCHANNEL_API == STD_ON)
    VAR(uint32, AUTOMATIC) u32TempMask = Adc_aRuntimeGroupChannel[Group].u32Mask;
#endif

    u8LeftChannel = u8NumChannel;

    /* Calculate number of PDB channels depending on the ADC channels used */
    /* Note that 1 PDB channel triggers to 8 ADC channels */
    u8PdbChannelUsed = (uint8)ADC_PDB_CHANNELS_USED(u8NumChannel);

    u16CurrentCh = u16CurrentChannel;
#if (ADC_SETCHANNEL_API == STD_ON)
    /* Get delay configuration of each pre-trigger */
    /* At runtime */
    pGroupDelay = Adc_aRuntimeGroupChannel[Group].pu16Delays;
#else
    /* Follow user configuration */
    pGroupDelay = pGroupPtr->pDelay;
#endif /* (ADC_SETCHANNEL_API == STD_ON) */

    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_12();
    /* Select the input trigger source for PDB */
    /** @violates @ref Adc_Pdb_c_REF_3 cast from unsigned long to pointer */
    /** @violates @ref Adc_Pdb_c_REF_7 A cast should not be performed between a pointer type and an integral type. */
    REG_RMW32(PDB_SC_REG_ADDR32(Unit), PDB_SC_TRGSEL_MASK_U32 | PDB_ENABLED_U32, PDB_TRIGGERn_SEL_U32((uint32)Trigger) | PDB_ENABLED_U32);

    /* Configure PDB channels */
    for(u8PdbIndex = 0U; u8PdbIndex < u8PdbChannelUsed; u8PdbIndex++)
    {
        /* Get channels used depending on number of pre-triggers per PDB channel */
        u8ChUsed = ADC_NUM_CHANNELS_USED(u8LeftChannel);

        /* Get mask for enable used channels to CHnC1 register */
        u32ChEnable = (uint32)PDB_CHNC1_MASK[u8ChUsed];

        /* Configuration data for all field in CHnC! register */
        u32ChConfig = u32ChEnable;

        /* If group channel delay, not bypass mode */
        if((uint8)STD_ON == pGroupPtr->u8AdcGroupChannelDelays)
        {
            /* If Back to Back mode is disabled, enable and configure delays for all channels */
            if((uint8)STD_OFF == pGroupPtr->u8AdcGroupBackToBack)
            {
                u32ChConfig |= (u32ChEnable << 8U);
                for(u8PreTriggerCtr = 0U; u8PreTriggerCtr < u8ChUsed; u8PreTriggerCtr++)
                {
            #if (ADC_SETCHANNEL_API == STD_ON)
                    if(1U == (u32TempMask & 1U))
            #endif
                    {
                        /* Configure delay for each pre-trigger */
                        /** @violates @ref Adc_Pdb_c_REF_3 cast from unsigned long to pointer */
                        /** @violates @ref Adc_Pdb_c_REF_7 A cast should not be performed between a pointer type and an integral type. */
                        /** @violates @ref Adc_Pdb_c_REF_6 Array indexing shall be the only allowed form of pointer arithmetic */
                        REG_WRITE32(PDB_CHnDLYx_REG_ADDR32(Unit, u8PdbIndex, u8PreTriggerCtr), pGroupDelay[u16CurrentCh + u8PreTriggerCtr]);
                    }
            #if (ADC_SETCHANNEL_API == STD_ON)
                    u32TempMask = u32TempMask >> 1U;
                    if (0U == u32TempMask)
                    {
                        break;
                    }
            #endif
                }
            }
            else /* ((uint8)STD_ON == pGroupPtr->u8AdcGroupBackToBack) */
                /* ((uint8)STD_ON == pGroupPtr->u8AdcGroupChannelDelays) */
            {
                /* Beginning part (8 ADC channels) of group will be configured in PDB channel 0 */
                if(0U == u16CurrentChannel)
                {
                    u32ChConfig |= (1UL << 8U);

