xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc_Pdb.c
                    /* First pre-trigger need to be configured as delay, others will be in back to back mode */
                    /** @violates @ref Adc_Pdb_c_REF_6 Array indexing shall be the only allowed form of pointer arithmetic */
                    u16PdbDelay = pGroupDelay[0] + ((pGroupPtr->u16PdbDelay)*u8PdbIndex);
                    /** @violates @ref Adc_Pdb_c_REF_3 cast from unsigned long to pointer */
                    /** @violates @ref Adc_Pdb_c_REF_7 A cast should not be performed between a pointer type and an integral type. */
                    /** @violates @ref Adc_Pdb_c_REF_6 Array indexing shall be the only allowed form of pointer arithmetic */
                    REG_WRITE32(PDB_CHnDLYx_REG_ADDR32(Unit, u8PdbIndex, (uint8)0), u16PdbDelay);
                }
                else
                {
                    /* The other parts will be configured in following PDB channels */
                    if(u8PdbIndex != 0U)
                    {
                        u32ChConfig |= (1UL << 8U);
                        u16PdbDelay = (pGroupPtr->u16PdbDelay)*u8PdbIndex;
                        /** @violates @ref Adc_Pdb_c_REF_3 cast from unsigned long to pointer */
                        /** @violates @ref Adc_Pdb_c_REF_7 A cast should not be performed between a pointer type and an integral type. */
                        /** @violates @ref Adc_Pdb_c_REF_6 Array indexing shall be the only allowed form of pointer arithmetic */
                        REG_WRITE32(PDB_CHnDLYx_REG_ADDR32(Unit, u8PdbIndex, (uint8)0), u16PdbDelay);
                    }
                }
            }
        }
        else    /* ((uint8)STD_OFF == pGroupPtr->u8AdcGroupChannelDelays) */
        {
            /* Configure the delay for the second PDB in case of only back to back used */
            /* The first PDB channel, pre-trigger 0 also need to use channel delay (TOS bit = 1) in order to work with continuous PDB mode */
            u32ChConfig |= (1UL << 8U);
            u16PdbDelay = (pGroupPtr->u16PdbDelay)*u8PdbIndex;
            /** @violates @ref Adc_Pdb_c_REF_3 cast from unsigned long to pointer */
            /** @violates @ref Adc_Pdb_c_REF_7 A cast should not be performed between a pointer type and an integral type. */
            /** @violates @ref Adc_Pdb_c_REF_6 Array indexing shall be the only allowed form of pointer arithmetic */
            REG_WRITE32(PDB_CHnDLYx_REG_ADDR32(Unit, u8PdbIndex, (uint8)0), u16PdbDelay);
        }

        /* Update status channel for configuring PDB channel in next loop */
        u8LeftChannel -= u8ChUsed;
        u16CurrentCh += u8ChUsed;

        /* Use back to back mode for all channels but using delay in pre-trigger 0 */
        if((uint8)STD_ON == pGroupPtr->u8AdcGroupBackToBack)
        {
            u32ChConfig |= ((u32ChEnable - 1U) << 16U);
        }

        /* Update configuration to CHnC1 register for pre-trigger */
        /** @violates @ref Adc_Pdb_c_REF_3 cast from unsigned long to pointer */
        /** @violates @ref Adc_Pdb_c_REF_7 A cast should not be performed between a pointer type and an integral type. */
        REG_WRITE32(PDB_CHCn1_REG_ADDR32(Unit, u8PdbIndex), u32ChConfig);
    }

#ifdef ADC_CONTINUOUS_NO_INTERRUPT_SUPPORTED
    /* If the continuous group is configured without interrupts then PDB will be configured as continuous mode */
    /* Program the Mode */
    if((ADC_CONV_MODE_CONTINUOUS == pGroupPtr->eMode) && ((uint8)STD_ON == pGroupPtr->u8AdcWithoutInterrupt))
    {
        u16PeriodPdb = pGroupPtr->u16PdbPeriod;
    }
    else
#endif /* ADC_CONTINUOUS_NO_INTERRUPT_SUPPORTED */
    {
        /* If group channel delay, not bypass mode */
        if((uint8)STD_ON == pGroupPtr->u8AdcGroupChannelDelays)
        {
            if((uint8)STD_OFF == pGroupPtr->u8AdcGroupBackToBack)
            {
                /* If delay mode for all pre-triggers, PDB period equals to value of last pre-trigger delay (i.e longest delay) */
                /** @violates @ref Adc_Pdb_c_REF_6 Array indexing shall be the only allowed form of pointer arithmetic */
                u16PeriodPdb = pGroupDelay[(u16CurrentChannel + u8NumChannel) - 1U];
            }
            else    /* ((uint8)STD_ON == pGroupPtr->u8AdcGroupBackToBack) */
            {
                /* Period will be calculated depending on user configuration in back to back mode */
                /** @violates @ref Adc_Pdb_c_REF_6 Array indexing shall be the only allowed form of pointer arithmetic */
                u16PeriodPdb = pGroupDelay[0] + (uint16)((pGroupPtr->u16PdbDelay)*((uint16)u8PdbChannelUsed - 1U));
            }
        }
        else    /* ((uint8)STD_OFF == pGroupPtr->u8AdcGroupChannelDelays) */
        {
            /* All pre-trigger configured as user u16PdbDelay */
            /** @violates @ref Adc_Pdb_c_REF_6 Array indexing shall be the only allowed form of pointer arithmetic */
            u16PeriodPdb = (pGroupPtr->u16PdbDelay)*((uint16)u8PdbChannelUsed - 1U);
        }
    }

    /* Configure the period of counter */
    /** @violates @ref Adc_Pdb_c_REF_3 cast from unsigned long to pointer */
    /** @violates @ref Adc_Pdb_c_REF_7 A cast should not be performed between a pointer type and an integral type. */
    REG_WRITE32(PDB_MOD_REG_ADDR32(Unit), u16PeriodPdb);

    /* Disable others PDB channels to avoid errors when PDB trigger the disabled channels */
    for(; u8PdbIndex < ADC_PDB_NUM_MODULES; u8PdbIndex++)
    {
        /** @violates @ref Adc_Pdb_c_REF_3 cast from unsigned long to pointer */
        /** @violates @ref Adc_Pdb_c_REF_7 A cast should not be performed between a pointer type and an integral type. */
        REG_WRITE32(PDB_CHCn1_REG_ADDR32(Unit, u8PdbIndex), 0U);
    }

    /* Load the configuration */
    /** @violates @ref Adc_Pdb_c_REF_3 cast from unsigned long to pointer */
    /** @violates @ref Adc_Pdb_c_REF_7 A cast should not be performed between a pointer type and an integral type. */
    REG_BIT_SET32(PDB_SC_REG_ADDR32(Unit), PDB_LOAD_OK_U32);

    /* ADC356, ADC357 */
    /* Start software trigger */
    /* If trigger is not software trigger, hardware trigger or external trigger will be used */
    if (PDB_SOFTWARE_TRIGGER_U32 == Trigger)
    {
#if (STD_ON == ADC_ENABLE_DOUBLE_BUFFERING)
        if ((boolean) TRUE == pGroupPtr->bAdcDoubleBuffering)
        {
            /* PDB operation in Continuous mode for software */
            /** @violates @ref Adc_Pdb_c_REF_3 cast from unsigned long to pointer */
            /** @violates @ref Adc_Pdb_c_REF_7 A cast should not be performed between a pointer type and an integral type. */
            REG_BIT_SET32(PDB_SC_REG_ADDR32(Unit), PDB_CONTINUOUS_MODE_U32);
        }
#endif /* (STD_ON == ADC_ENABLE_DOUBLE_BUFFERING) */

        /** @violates @ref Adc_Pdb_c_REF_3 cast from unsigned long to pointer */
        /** @violates @ref Adc_Pdb_c_REF_7 A cast should not be performed between a pointer type and an integral type. */
        REG_BIT_SET32(PDB_SC_REG_ADDR32(Unit), PDB_SOFTWARE_TRIGGER_RESET_COUNTER_U32);
    }
#if (ADC_SETCHANNEL_API == STD_OFF)
    /* Avoid compiler warning */
    (void)Group;
#endif

