xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc_Pdb.c
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_12();
}

/**
* @brief          This function start software conversion via PDB
* @details        This function is used when no need to reconfigure PDB channels
*
* @param[in]      Unit                    the current HW Unit.
*
* @return         void
*
*/
/** @violates @ref Adc_Pdb_c_REF_5 External linkage.*/
FUNC(void, ADC_CODE) Adc_Pdb_StartSoftwareConversion
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit
)
{
    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_13();
    /** @violates @ref Adc_Pdb_c_REF_3 cast from unsigned long to pointer */
    /** @violates @ref Adc_Pdb_c_REF_7 A cast should not be performed between a pointer type and an integral type. */
    REG_BIT_SET32(PDB_SC_REG_ADDR32(Unit), PDB_SOFTWARE_TRIGGER_RESET_COUNTER_U32);
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_13();
}

#ifdef ADC_CONTINUOUS_NO_INTERRUPT_SUPPORTED
/**
* @brief          This function changes mode of PDB hardware unit
* @details        This function changes PDB hardware unit to continuous trigger mode if ADC converts without interrupt
*
* @param[in]      Unit                    the current HW Unit.
*
* @return         void
*
*/
/** @violates @ref Adc_Pdb_c_REF_5 External linkage.*/
FUNC(void, ADC_CODE) Adc_Pdb_SetPdbMode
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit,
    VAR(boolean, AUTOMATIC) bContinuous
)
{
    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_14();
    if((boolean)TRUE == bContinuous)
    {
        /* PDB operation in Continuous mode */
        /** @violates @ref Adc_Pdb_c_REF_3 cast from unsigned long to pointer */
        /** @violates @ref Adc_Pdb_c_REF_7 A cast should not be performed between a pointer type and an integral type. */
        REG_BIT_SET32(PDB_SC_REG_ADDR32(Unit), PDB_CONTINUOUS_MODE_U32);
    }
    else
    {
        /* PDB operation in One-Shot mode */
        /** @violates @ref Adc_Pdb_c_REF_3 cast from unsigned long to pointer */
        /** @violates @ref Adc_Pdb_c_REF_7 A cast should not be performed between a pointer type and an integral type. */
        REG_BIT_CLEAR32(PDB_SC_REG_ADDR32(Unit), PDB_CONTINUOUS_MODE_U32);
    }
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_14();
}
#endif

/**
* @brief          This function stops PDB hardware unit
* @details        This function disables PDB module and make control registers to reset value
*
* @param[in]      Unit                    the current HW Unit.
*
* @return         void
*
*/
/** @violates @ref Adc_Pdb_c_REF_5 External linkage.*/
FUNC(void, ADC_CODE) Adc_Pdb_StopConversion
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit
)
{
    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_15();
    /** @violates @ref Adc_Pdb_c_REF_3 cast from unsigned long to pointer */
    /** @violates @ref Adc_Pdb_c_REF_7 A cast should not be performed between a pointer type and an integral type. */
    REG_BIT_CLEAR32(PDB_SC_REG_ADDR32(Unit), PDB_ENABLED_U32);
#ifdef ADC_CONTINUOUS_NO_INTERRUPT_SUPPORTED
    /** @violates @ref Adc_Pdb_c_REF_3 cast from unsigned long to pointer */
    /** @violates @ref Adc_Pdb_c_REF_7 A cast should not be performed between a pointer type and an integral type. */
    REG_BIT_CLEAR32(PDB_SC_REG_ADDR32(Unit), PDB_CONTINUOUS_MODE_U32);
#endif
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_15();
    
    /** @violates @ref Adc_Pdb_c_REF_3 cast from unsigned long to pointer */
    /** @violates @ref Adc_Pdb_c_REF_7 A cast should not be performed between a pointer type and an integral type. */
    REG_WRITE32(PDB_CHCn1_REG_ADDR32(Unit, (uint8)0), PDB_CH_CONTROL_RESET_VALUE_U32);
    /** @violates @ref Adc_Pdb_c_REF_3 cast from unsigned long to pointer */
    /** @violates @ref Adc_Pdb_c_REF_7 A cast should not be performed between a pointer type and an integral type. */
    REG_WRITE32(PDB_CHCn1_REG_ADDR32(Unit, (uint8)1), PDB_CH_CONTROL_RESET_VALUE_U32);
    /** @violates @ref Adc_Pdb_c_REF_3 cast from unsigned long to pointer */
    /** @violates @ref Adc_Pdb_c_REF_7 A cast should not be performed between a pointer type and an integral type. */
    REG_WRITE32(PDB_CHnS_REG_ADDR32(Unit, (uint8)0), PDB_CH_STATUS_RESET_VALUE_U32);
    /** @violates @ref Adc_Pdb_c_REF_3 cast from unsigned long to pointer */
    /** @violates @ref Adc_Pdb_c_REF_7 A cast should not be performed between a pointer type and an integral type. */
    REG_WRITE32(PDB_CHnS_REG_ADDR32(Unit, (uint8)1), PDB_CH_STATUS_RESET_VALUE_U32);
}

#define ADC_STOP_SEC_CODE
/**
 * @violates @ref Adc_Pdb_c_REF_2 Repeated include file MemMap.h
 * @violates @ref Adc_Pdb_c_REF_1 Only preprocessor statements and comments before "#include"
 */
#include "Adc_MemMap.h"

#ifdef __cplusplus
}
#endif

/** @} */
